<a href="https://colab.research.google.com/github/tewei0328/AI/blob/master/%E5%96%AE%E5%85%833/3-4_titanic_shape_describe_info.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.取得鐵達尼號完整資料集

In [0]:
import pandas as pd

In [0]:
titanic=pd.read_csv('https://raw.githubusercontent.com/tewei0328/data/master/titanic.csv')

In [0]:
titanic.shape

(1313, 11)

In [0]:
titanic.head()

   row.names pclass  survived  ...      ticket   boat     sex
0          1    1st         1  ...  24160 L221      2  female
1          2    1st         0  ...         NaN    NaN  female
2          3    1st         0  ...         NaN  (135)    male
3          4    1st         0  ...         NaN    NaN  female
4          5    1st         1  ...         NaN     11    male

[5 rows x 11 columns]

In [0]:
titanic.head(10)

   row.names pclass  survived  ...      ticket   boat     sex
0          1    1st         1  ...  24160 L221      2  female
1          2    1st         0  ...         NaN    NaN  female
2          3    1st         0  ...         NaN  (135)    male
3          4    1st         0  ...         NaN    NaN  female
4          5    1st         1  ...         NaN     11    male
5          6    1st         1  ...         NaN      3    male
6          7    1st         1  ...   13502 L77     10  female
7          8    1st         0  ...         NaN    NaN    male
8          9    1st         1  ...         NaN      2  female
9         10    1st         0  ...         NaN   (22)    male

[10 rows x 11 columns]

In [0]:
titanic.tail()

      row.names pclass  survived  ... ticket  boat     sex
1308       1309    3rd         0  ...    NaN   NaN    male
1309       1310    3rd         0  ...    NaN   NaN    male
1310       1311    3rd         0  ...    NaN   NaN    male
1311       1312    3rd         0  ...    NaN   NaN  female
1312       1313    3rd         0  ...    NaN   NaN    male

[5 rows x 11 columns]

In [0]:
titanic.describe()

         row.names     survived         age
count  1313.000000  1313.000000  633.000000
mean    657.000000     0.341965   31.194181
std     379.174762     0.474549   14.747525
min       1.000000     0.000000    0.166700
25%     329.000000     0.000000   21.000000
50%     657.000000     0.000000   30.000000
75%     985.000000     1.000000   41.000000
max    1313.000000     1.000000   71.000000

In [0]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 11 columns):
row.names    1313 non-null int64
pclass       1313 non-null object
survived     1313 non-null int64
name         1313 non-null object
age          633 non-null float64
embarked     821 non-null object
home.dest    754 non-null object
room         77 non-null object
ticket       69 non-null object
boat         347 non-null object
sex          1313 non-null object
dtypes: float64(1), int64(2), object(8)
memory usage: 113.0+ KB

# 2.將資料切片成特徵X, 和答案y
並進一步切割成訓練集, 和測試集

In [0]:
X=titanic[['pclass','age','sex']]

In [0]:
X.head()

  pclass      age     sex
0    1st  29.0000  female
1    1st   2.0000  female
2    1st  30.0000    male
3    1st  25.0000  female
4    1st   0.9167    male

In [0]:
y=titanic[['survived']]

In [0]:
y.head()

   survived
0         1
1         0
2         0
3         0
4         1

# 3. 將資料進一步切割成訓練集, 和測試集

In [0]:
from sklearn.model_selection import train_test_split

In [0]:
X_train, X_test, y_train, y_test=train_test_split(X, y, test_size=0.25, random_state=33)

# 4. 取特徵

In [0]:
from sklearn.feature_extraction import DictVectorizer